In [1]:
import pandas as pd

In [24]:
df = pd.DataFrame({'col1' : [1,2,3,4], 'col2' : ["Keshav","Srinidhi","Chandan","Aswin"], 'col3' : [111,112,113,114]})

In [6]:
df

   col1      col2  col3
0     1    Keshav   111
1     2  Srinidhi   112
2     3   Chandan   113
3     4     Aswin   114

In [9]:
df.head()

   col1      col2  col3
0     1    Keshav   111
1     2  Srinidhi   112
2     3   Chandan   113
3     4     Aswin   114

In [10]:
df.tail()

   col1      col2  col3
0     1    Keshav   111
1     2  Srinidhi   112
2     3   Chandan   113
3     4     Aswin   114

In [16]:
df['col2'].count()

4

In [27]:
df['col2'].unique()

array(['Keshav', 'Srinidhi', 'Chandan', 'Aswin'], dtype=object)

In [26]:
df['col2'].nunique()

4

In [32]:
df['col2'].value_counts()

col2
Keshav      1
Srinidhi    1
Chandan     1
Aswin       1
Name: count, dtype: int64

In [38]:
import numpy as np
df2 = pd.DataFrame({'col1' : [10,np.nan,30,40], 'col2' : ['aaa','bbb',np.nan,'ddd'], 'col3' : [111,222,333,np.nan]})

In [39]:
df2

   col1 col2   col3
0  10.0  aaa  111.0
1   NaN  bbb  222.0
2  30.0  NaN  333.0
3  40.0  ddd    NaN

In [48]:
df2.dropna()

   col1 col2   col3
0  10.0  aaa  111.0

In [49]:
del df['col2']

In [50]:
df

   col1  col3
0     1   111
1     2   112
2     3   113
3     4   114

In [61]:
df2.sort_values(by = 'col1')

   col1 col2   col3
0  10.0  aaa  111.0
2  30.0  NaN  333.0
3  40.0  ddd    NaN
1   NaN  bbb  222.0

In [62]:
df2.fillna('FILL')

   col1  col2   col3
0  10.0   aaa  111.0
1  FILL   bbb  222.0
2  30.0  FILL  333.0
3  40.0   ddd   FILL